RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_adc.c
/*********************************************************************************************************//**
 * @brief Configure the ADC trigger source for high priority channels conversion.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param ADC_TRIG_x:
 *   This parameter can be one of the following values:
 *     @arg ADC_TRIG_EXTI_n     : where n can be 0 ~ 15
 *     @arg ADC_TRIG_MCTMn_MTO  : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CH0O : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CH1O : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CH2O : where n can be 0
 *     @arg ADC_TRIG_MCTMn_CH3O : where n can be 0
 *     @arg ADC_TRIG_GPTMn_MTO  : where n can be 0 ~ 1
 *     @arg ADC_TRIG_GPTMn_CH0O : where n can be 0 ~ 1
 *     @arg ADC_TRIG_GPTMn_CH1O : where n can be 0 ~ 1
 *     @arg ADC_TRIG_GPTMn_CH2O : where n can be 0 ~ 1
 *     @arg ADC_TRIG_GPTMn_CH3O : where n can be 0 ~ 1
 *     @arg ADC_TRIG_BFTMn      : where n can be 0 ~ 1
 *     @arg ADC_TRIG_PWMn_MTO   : where n can be 0 ~ 1
 *     @arg ADC_TRIG_PWMn_CH0O  : where n can be 0 ~ 1
 *     @arg ADC_TRIG_PWMn_CH1O  : where n can be 0 ~ 1
 *     @arg ADC_TRIG_PWMn_CH2O  : where n can be 0 ~ 1
 *     @arg ADC_TRIG_PWMn_CH3O  : where n can be 0 ~ 1
 *     @arg ADC_HPTRIG_CMPn     : where n can be 0 ~ 1
 * @retval None
 ************************************************************************************************************/
void ADC_HPTrigConfig(HT_ADC_TypeDef* HT_ADCn, u32 ADC_TRIG_x)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_ADC_HPTRIG(ADC_TRIG_x));

  HT_ADCn->HTCR = ADC_TRIG_x & 0x0000001F;
  HT_ADCn->HTSR = ADC_TRIG_x & (~0x0000001F);
}

/*********************************************************************************************************//**
 * @brief Configure the channel data alignment format.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param ADC_CH_n: the ADC channel to configure
 *   This parameter can be one of the following values:
 *     @arg ADC_CH_n        : ADC Channel x selected
 *     @arg ADC_CH_OPAn     : ADC channel for OPAn
 *     @arg ADC_CH_GND_VREF : ADC GND VREF selected
 *     @arg ADC_CH_VDD_VREF : ADC VDD VREF selected
 * @param ADC_ALIGN_x: ADC_ALIGN_RIGHT or ADC_ALIGN_LEFT
 * @retval None
 ************************************************************************************************************/
void ADC_ChannelDataAlign(HT_ADC_TypeDef* HT_ADCn, u8 ADC_CH_n, ADC_ALIGN_Enum ADC_ALIGN_x)
{
  u32 OFRValue;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_ADC_CHANNEL(ADC_CH_n));
  Assert_Param(IS_ADC_ALIGN(ADC_ALIGN_x));

  OFRValue = HT_ADCn->OFR[ADC_CH_n] & (~(OFR_ADAL));
  OFRValue |= ADC_ALIGN_x;

  HT_ADCn->OFR[ADC_CH_n] = OFRValue;
}

/*********************************************************************************************************//**
 * @brief Configure the offset value for channel offset cancellation.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param ADC_CH_n: the ADC channel to configure
 *   This parameter can be one of the following values:
 *     @arg ADC_CH_n        : ADC Channel x selected
 *     @arg ADC_CH_OPAn     : ADC channel for OPAn
 *     @arg ADC_CH_GND_VREF : ADC GND VREF selected
 *     @arg ADC_CH_VDD_VREF : ADC VDD VREF selected
 * @param OffsetValue: The offset value
 * @retval None
 ************************************************************************************************************/
void ADC_ChannelOffsetValue(HT_ADC_TypeDef* HT_ADCn, u8 ADC_CH_n, u16 OffsetValue)
{
  u32 OFRValue;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_ADC_CHANNEL(ADC_CH_n));
  Assert_Param(IS_ADC_OFFSET(OffsetValue));

  OFRValue = HT_ADCn->OFR[ADC_CH_n] & (~OFR_ADOF_MASK);
  OFRValue |= (OffsetValue & 0xFFF);
  HT_ADCn->OFR[ADC_CH_n] = OFRValue;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the channel offset cancellation function.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param ADC_CH_n: the ADC channel to configure
 *   This parameter can be one of the following values:
 *     @arg ADC_CH_n        : ADC Channel x selected
 *     @arg ADC_CH_OPAn     : ADC channel for OPAn
 *     @arg ADC_CH_GND_VREF : ADC GND VREF selected
 *     @arg ADC_CH_VDD_VREF : ADC VDD VREF selected
 * @param NewState: ENABLE DISABLE
 * @retval None
 ************************************************************************************************************/
void ADC_ChannelOffsetCmd(HT_ADC_TypeDef* HT_ADCn, u8 ADC_CH_n, ControlStatus NewState)
{
  u32 OFRValue;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_ADC_CHANNEL(ADC_CH_n));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  OFRValue = HT_ADCn->OFR[ADC_CH_n] & (~(OFR_ADOFE));

  if (NewState == ENABLE)
  {
    OFRValue |= OFR_ADOFE;
  }

  HT_ADCn->OFR[ADC_CH_n] = OFRValue;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable software start of the regular channel conversion of the selected ADC.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ADC_SoftwareStartConvCmd(HT_ADC_TypeDef* HT_ADCn, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Start Conversion                                                                                       */
  if (NewState != DISABLE)
  {
    HT_ADCn->TSR |= TCR_SC_SET;
  }
  else
  {
    HT_ADCn->TSR &= ~TCR_SC_SET;
  }
}

